/*Условие задачи:
Напишите программу на Go, которая реализует схему обработки данных с использованием паттернов Fan-In и Fan-Out.
Ваше задание:
Реализовать функцию, которая берёт на вход несколько каналов с числами.
Каждые полученные числа нужно параллельно обработать (например, возвести в квадрат или удвоить).
Затем объединим результаты обратно в один канал и выведем их на экран.
Правила:
Использовать паттерн Fan-Out для распределения задач по рабочим горутинам.
Применить паттерн Fan-In для сбора результатов.
Должна быть предусмотрена возможность остановки работы по желанию (через контекст или иными средствами).
Пример:
Пусть у вас есть два канала:

Канал 1: {1, 2, 3}
Канал 2: {4, 5, 6}*/

package main

func main() {

}
