/*
Вам даны несколько каналов, каждый из которых отправляет случайные числа в диапазоне от 1 до 100. Ваша задача — написать функцию, которая объединяет все эти каналы в один канал таким образом, чтобы в итоге все числа из входных каналов попадали в единый выходной канал без дублирования и сохраняли уникальный порядок следования (первое появление числа считается уникальным порядком).

Пример:
Предположим, имеются три канала:

Канал 1: {1, 3, 5}
Канал 2: {2, 4, 5}
Канал 3: {3, 6, 7}
Результатом вашей функции будет канал, возвращающий следующую последовательность чисел: {1, 2, 3, 4, 5, 6, 7}, без повторений.
*/
package main
