/*
   Слияние каналов строк с удалением дубликатов
   Описание задачи:

   Даны несколько каналов строк, каждый из которых передает строки в произвольном порядке.
   Необходимо объединить данные из этих каналов в один канал, но при этом каждая строка
   должна встречаться в выходном канале только один раз.

   Условия:
   - Функция должна принимать на вход несколько каналов строк.
   - Должен вернуться новый канал, из которого можно читать объединённые строки без повторов.
   - Порядок появления строк в результирующем канале не фиксируется (может быть любым).
   - Обработка должна быть конкурентной.
*/

package main
