/*Простая задача на пулл воркеров (Pool Workers) в Go
Условие задачи:
Вы разрабатываете систему, которая обрабатывает задачи в отдельном пуле воркеров (рабочих потоков). Предположим, что у вас есть некоторый набор задач, которые нужно выполнить параллельно. Вам необходимо создать пулл воркеров, состоящий из фиксированного количества горутин, каждая из которых способна обрабатывать поступающие задачи.

Требования:
Создайте пулл воркеров, состоящий из 3 рабочих потоков (воркеров).
Пулл должен быть способен обрабатывать задачи из входящего канала.
Воркер выполняет простую задачу: получает число, удваивает его и отправляет результат в выходной канал.
Запустите пулл и продемонстрируйте его работу на примерах.
Пример работы программы:
На вход подается канал с числами: {1, 2, 3, 4, 5}.
Программа должна обработать эти числа и возвратить удвоенные значения: {2, 4, 6, 8, 10}.
*/
package main

func(chIn)
func main(){

}